2024/rapport-2024-10-11.org
#+title: Rapport hebdomadaire
#+subtitle: Contrat Été 2024
#+author: Charles-Édouard Lizotte
#+date:11/10/2024
#+LANGUAGE: fr
#+BIBLIOGRAPHY: master-bibliography.bib
#+OPTIONS: toc:nil title:nil 
#+LaTeX_class: org-report


* Tâches à accomplir pour la semaine

+ [3/4] *Terminer la reproduction des résultats de Bismuth avec le set-up de Jeremy et Dany* : J'ai eu quelques problèmes avec Wavewatch à l'installation. Par la suite, les /switches/ de /Wavewatch III/ que Jérémy m'a fournit ont activé quelques champs dont je ne connaissais pas l'existence.
  - [X] Il faut reproduire le motif de glace d'Éliot Bismuth;
  - [X] S'assurer que le données NetCDF entrent bien dans le modèle de vagues;
  - [1/2] Trouver un moyen de forcer le champ de vagues d'un seul côté seulement;
    - [X] Modifier la fonction /ww3 grid/ pour changer la /mapsta/ et inclure des points frontière;
    - [ ] Inclusion des points frontière;
  - [X] Il faut aussi terminer la fonction de distribution de la glace pour lancer plusieurs tâches en même temps en série;
  - [ ] Conceptualiser un moyen de lire les données sortantes pour le champ de glace. Eliot Bismuth utilisait un rapport du premier moment « $m_0$ »
    
+ [1/2] *Retour à Daniella pour la réalisation du «Word Package II»* : Daniella avait pas mal accepté mon aide par courriel. Elle m'a rajouté dans le Teams du /Word Package II/.
  - [X] Recontacter l'équipe, dont Jérémy. 
  - [ ] Il faut avoir plus d'information de la part de l'ingénieur de Blair. On a très peu d'information sur la manière qu'il fera ses simulation de vagues et de glace.
    
+ [0/1] *Lecture du code de Sebastien Dugas pour WAM* :
  - [ ] Il faut repenser les axes de développement pour s'assurer que le but de ma recherche passe dans les enjeux du milieu.


* Retour sur l'expérience de Bismuth avec Wavewatch III

** Ce qu'on doit implémenter en terme de glace dans Wavewatch III

Dans le [[file:Fichiers_pdf/rapport-2024-09-20.pdf][rapport du 20 septembre]], nous avions un petit tableau qui résumait les expériences de Bismuth.

#+name:tab:bismuth
#+attr_latex: :placement [!h]
#+caption: Tableau tiré de la maîtrise d'Éliot Bimuth.
|----------------------------------+--------------+--------+-------------------|
|----------------------------------+--------------+--------+-------------------|
| <l>                              |     <c>      |    <r> |        <c>        |
| Description de la variable       |   Symbole    | Valeur |      Unités       |
|----------------------------------+--------------+--------+-------------------|
| Taille de la grille              |    $L_x$     |      5 |        km         |
| Taille des points de grille      |  $\Delta x$  |    500 |         m         |
| Nombre de points de grille       |    $n_x$     |     10 |        --         |
| Épaisseur des floes              |     $h$      |    0.5 |         m         |
| Diamètre moyen des floes         | $\expval{D}$ |    200 |         m         |
| Période du maximum spectral      |    $T_p$     |      6 |         s         |
| Fréquence du maximum spectral    |    $f_p$     |    1/6 | $\mathrm{s}^{-1}$ |
| Hauteur significative des vagues |    $H_s$     |      1 |         m         |
| Minimum de fréquence du modèle   |  $f_{min}$   |   1/20 | $\mathrm{s}^{-1}$ |
| Maximum de fréquence du modèle   |  $f_{max}$   |  1/2.5 | $\mathrm{s}^{-1}$ |
| Nombre de fréquences du modèle   |     $n_f$    |     61 |        --         |
|----------------------------------+--------------+--------+-------------------|


#+attr_latex: :placement [!h]
#+caption: D'autres quantités qui seraient importante lors de la modélisation avec Wavewatch III.
|------------------------+------------+-------------+--------------------+----------------------------------------|
|------------------------+------------+-------------+--------------------+----------------------------------------|
| <l>                    |    <c>     |         <r> |        <c>         | <l>                                    |
| Description            |  Symbole   |      Valeur |       Unités       | Note                                   |
|------------------------+------------+-------------+--------------------+----------------------------------------|
| Champ gravitationnel   |    $g$     |        9.81 | $\mathrm{ms}^{-2}$ | --                                     |
| Vitesse de phase       |   $c_p$    | (max) 38.52 | $\mathrm{ms}^{-1}$ | $c_p = g/\omega$                       |
| Vitesse de groupe      |   $c_g$    | (max) 19.26 | $\mathrm{ms}^{-1}$ | $c_g = c_p/2$                          |
| Pas de temps           | $\Delta t$ |       25.00 |         s          | $\Delta t < \Delta x/c^{max}_g$        |
|------------------------+------------+-------------+--------------------+----------------------------------------|
| Nombre de fréquences   |    $nf$    |          40 |         --         | [cite:Voir @wwiii2016user switch NL2 ] |
| /Freq. Increment Factor/ |    $IF$    |        1.07 |         --         | [cite:Voir @wwiii2016user switch NL2 ] |
| Fréquence initiale     | $f_{min}$  |        0.05 | $\mathrm{s}^{-1}$  | Comme suggéré par Eliot Bismuth        |
| Fréquences maximale    | $f_{max}$  |          -- | $\mathrm{s}^{-1}$  | $f_{max} = f_{min}\cdot(IF)^{nf}$      |
| Nombre de directions   | $n_\theta$ |          36 |         --         | [cite:Voir @wwiii2016user switch NL2 ] |
|------------------------+------------+-------------+--------------------+----------------------------------------|

*** Carte de points de Wavewatch III

Grossièrement, on voudrait que l'entrée et la sortie de notre canal ne soit pas dans le modèle. Concrétement, ça se traduit pas l'abscence de murs sur les côtés ouest et est, mais des murs sur les côtés nord et sud. Ainsi, la /mapsta/ devrait ressembler à
#+attr_latex: :mode math :environment matrix
| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |
| 3 | 2 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 3 |
| 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |

Donc visuellement, on voit déjà le canal. Visuellement, on se souvient de ça dans le rapport d'octobre :

#+attr_latex: :placement [h!]
#+name:fig:grid
#+caption: Grille initiale fournie à Wavewatch III.
\begin{figure}
\begin{center}
\begin{tikzpicture}
   \fill [ForestGreen!10] (0,0) rectangle (10,3);
   \fill [blue!15] (1,1) rectangle (9,2);
   \fill [white] (0,1) rectangle (1,2);
   \fill [white] (9,1) rectangle (10,2);
   \fill [red!15] (1,1) rectangle (2,2);
   \draw[dotted] (0,0) grid (10,3);
   \draw[thick] (0,0) rectangle (10,3);
%%%
   \draw[|{latex}-{latex}|] (10.25,0) -- (10.25,3);
   \draw (10.25,1.5) node [rotate=90,below] {$150$ m};
   \draw[|{latex}-{latex}|] (0,-0.25) -- (10,-0.25);
   \draw (5,-0.5) node [below] {$500$ m};
%%%
   \filldraw [dotted] (-0.25,0.5) -- (0.5,0.5);
   \filldraw [dotted] (-0.25,2.5) -- (0.5,2.5) circle (1pt);
   \draw [decoration={brace}, decorate, thick] (-0.25,0.5) -- (-0.25,2.5);
   \draw (-0.5,1.5) node [rotate=90,above] { 25m à 125m};
%%%
   \filldraw [dotted] (0.5,3.25) -- (0.5,2.5);
   \filldraw [dotted] (9.5,3.25) -- (9.5,2.5) circle (1pt);
   \draw [decoration={brace}, decorate, thick] (0.5,3.25) -- (9.5,3.25);
   \draw (5,3.5) node [above] { 25m à 475m};
 %%%
   \filldraw (0.5,0.5) circle (1pt);
   \draw (0.5,0.5) node [right] {(25m,25m)};
\end{tikzpicture}
\end{center}
\end{figure}


*** Introduction des conditions frontières dans Wavewatch III

En premier lieu, il faut le mentionner dans la création de notre fichier /mapsta/. Le nombre 2 permet de dire au modèle qu'on veut des points frontière. Ensuite, selon la documentation de Wavewatch : \medskip
#+begin_quote
/If the actual input data is not defined in the actual wave model run, the initial conditions will be applied as constant boundary conditions./\medskip
#+end_quote
Par conséquent, on peut ne rien définir dans le fichier /ww3 grid/, puis ensuite changer les conditions initiales. L'idée derrière serait donc de laisser le modèle se stabiliser graduellement autour des conditions initiales.\bigskip

Il faut donc créer un spectre Jonswap [cite:@hasselmann1973measurements]. Nous avions pris quelques notes dans notre [[file:rapport-2024-08-23.pdf][rapport du 23 aout 2024]] pour synthétiser les données entrantes d'Eliot Bismuth.

| <l>                         |         <c>         |  <c>   |  <c>   | <l>                                                   |
|-----------------------------+---------------------+--------+--------+-------------------------------------------------------|
|-----------------------------+---------------------+--------+--------+-------------------------------------------------------|
| Description                 |       Symbole       | Valeur | Unités | Notes                                                 |
|-----------------------------+---------------------+--------+--------+-------------------------------------------------------|
| Constante pour Goda         |         --          | 0.205  |   ?    | [cite/t/c:@goda1988variablity]                        |
| /Energy level of PM spectrum/ |      $\alpha$       | 0.0081 |   --   | [cite/t/c:@wwiii2016user] (Constante de Phillips)     |
| /Peak frequency/              |        $f_m$        |  1/6   |   Hz   | (Maîtrise d'Eliot Bismuth)                            |
| /Peak enhancement factor/     |      $\gamma$       |  3.3   |   --   | [cite/t/c:@hasselmann1973measurements;@wwiii2016user] |
| /Spread with GAMMA/           |     $\sigma_A$      |  0.07  |   --   | [cite/t/c:@hasselmann1973measurements;@wwiii2016user] |
| /Spread with GAMMA/           |     $\sigma_B$      |  0.09  |   --   | [cite/t/c:@hasselmann1973measurements;@wwiii2016user] |
| Moyenne directionnelle      | $\overline{\theta}$ |   90   | degrés | [cite/t/c:@wwiii2016user] (Convention océanographique) |
|-----------------------------+---------------------+--------+--------+-------------------------------------------------------|

L'Équation devrait ressembler à (selon la version de [cite/t/c:@goda1988variablity]),
\begin{equation}
   E_{JONSWAP-Goda}(f) = 0.205 H_s^2 \qty(\frac{f_p^4}{f^5}) \exp{-\frac{5}{4}\qty(\frac{f_p}{f})^4} \times 3.3^{\exp{\frac{-(f-f_p)^2}{2\sigma^2 f_p^2}}},
\end{equation}
ou plutôt (selon la version [cite/t/c:@hasselmann1973measurements]), 
\begin{align}
   && E_{JONSWAP}(f) = \alpha g^2 (2\pi)^{-4} f^{-5} \exp[- \frac{5}{4} \qty(\frac{f}{f_m})^{-4}]\times \gamma^{g(f,\sigma)}
   && \text{où}
   && g(f,\sigma) = \exp[ \frac{-(f-f_m)^2}{2\sigma^2f_m^2}]. &&
\end{align}
Selon [cite/t/c:@goda1988variablity] et [cite/t/c:@hasselmann1973measurements], $\alpha = 0.205$, mais selon Dugas $\alpha = 0.2044$. Il a surement une citation que je n'ai pas.

*** Lancement de Wavewatch III

Lorsqu'on lance le modèle, on voit apparaître l'avertissement suivant
#+begin_quote
 *** WAVEWATCH III WARNING IN W3IOBC : 
     INPUT FILE WITH BOUNDARY CONDITIONS NOT FOUND
     BOUNDARY CONDITIONS WILL NOT BE UPDATED     1
#+end_quote
donc on en déduit que la méthode employée plus haut pour y mettre nos /boundary conditions/ est bonne. Il ne reste qu'à tester le modèle, en fait.


#+print_bibliography:
