2024/Fichiers_tex/rapport-2024-10-11.tex
% Created 2024-10-10 Thu 15:06
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
% =================================BASE====================================%
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc
\usepackage{csquotes} % Recommandé par PDFLatex lors de la compilation. 

% Calligraphie
%\usepackage{pxfonts} % Met le texte ET les maths en Palatino + donne accès à des symboles math
%\usepackage{palatino} % Cette commande met seulement le texte en police palatino
\usepackage{lmodern} % Pour les maths? Lmodern pour les maths
\usepackage{cfr-lm}
% Use lmodern for sans-serif
\usepackage{mathrsfs} % Permet la command \mathscr (Lettres attachées genre) \mathscr(ABC)
\usepackage{eucal}   % Vient changer le \mathcal{ABC} parce que celui de base est laid.

% Bibliographie
\usepackage[backend=biber,style=alphabetic,sorting=ynt,maxbibnames=99]{biblatex}
%\usepackage[backend=biber,sorting=ynt,style=authoryear]{biblatex} % Ça semble tout changer.
\addbibresource{master-bibliography.bib}


\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.
\usepackage{mathtools,cancel,xfrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}, xfrac
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage{colortbl} % Color tables
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.

% Physique
\usepackage{physics} % Meilleur package pour physicien. 

% Style
\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usetikzlibrary{arrows.meta,bending, shapes.geometric, automata, positioning, decorations.pathreplacing} % Arrow heads et les formes de noeuds
\usepackage{empheq} % Boite autour de MULTIPLE équations
\usepackage{bbding}

% Français
\usepackage[french]{babel} % Environnements en Français.

\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate
% ==============================BASE-(END)=================================%





% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt}
\setlength{\parskip}{0.15cm}

% Tableaux/tabular
% Espace vertical dans les tabular/tableaux
\renewcommand{\arraystretch}{1.2}
% Couleur des tableaux/tabular
% \rowcolors{3}{violet!5}{}

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}


% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}


% On a des lignes à droite des sections et sous-sections
\usepackage[explicit]{titlesec}
    % Raised Rule Command:
    % Arg 1 (Optional) - How high to raise the rule
    % Arg 2 - Thickness of the rule
    \newcommand{\raisedrulefill}[2][0ex]{\leaders\hbox{\rule[#1]{1pt}{#2}}\hfill}
    \titleformat{\section}{\Large\bfseries}{\thesection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.25pt}}
    \titleformat{\subsection}{\large\bfseries}{\thesubsection. }{0em}{#1\;\raisedrulefill[0.4ex]{0.10pt}}


% Change bullet style
%\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
%\setlist[itemize,1]{label=\ding{239}}
%\setlist[itemize,1]{label=$\cdot$}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% CQFD symbol
\renewcommand{\qedsymbol}{$\hfill\blacksquare$}
\newcommand{\cqfd}{\hfill$\blacktriangleleft$}

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\evf}{\vb{\hat{e}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}
\newcommand{\uu}{\vb{u}}
\newcommand{\vv}{\vb{v}}
\newcommand{\ust}{\vb{u}_{\ast}}
\newcommand{\xx}{\vb{x}}
\newcommand{\rad}{\text{Rad}}

% Physics empty spaces 
\newcommand{\short}{\vphantom{pA}}
\newcommand{\tall}{\vphantom{pA^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}
\newcommand{\pt}{\hspace{1pt}} % One horizontal pt space

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env : (\ding{89})
%\newcommand{\nb}{$\boxed{\text{\footnotesize\EightStarConvex}\pt \mathfrak{N. B.}}$\hspace{4pt}}
\newcommand{\nb}{\underline{{\footnotesize\EightStarConvex}\pt $\mathfrak{N.B.}$\vphantom{p}}\hspace{3pt}}

\newcommand{\exemple}{
\parbox[center]{2.2cm}{\begin{tcolorbox}[sharp corners, rounded corners=northeast, rounded corners=southeast,
colback=Violet!2, colframe=black,
size=small, width=2cm, left=-0.25pt, bottom=-0.5pt,
arc is angular, arc=2.5mm, boxrule=0.35pt, leftrule=4pt, %bottomrule=1pt,
after={\enskip}] Exemple \end{tcolorbox}}}

% Define the nota bene environment
\usepackage{tcolorbox}
\newtcolorbox{notabene}{
     colback=blue!5,
     colframe=black,
     boxrule=0.5pt,
     arc=2pt,
     left=5pt,
     right=5pt,
     top=5pt,
     bottom=5pt,
}


\newcommand{\cmark}{\ding{52}}
\newcommand{\xmark}{\ding{55}}

%\newcommand{\fourier}[1]{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}\,}\qty[#1]}
\newcommand{\fourier}{\operatorname{\raisebox{-0.4em}{\resizebox{2em}{!}{$\mathscr{F}$}}}}
% Mettre (a,b) à la suite d'une série d'équations horizontales.
\newcommand{\ab}{\refstepcounter{equation}\tag{\theequation a,b}}
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Huge \thesubtitle \par}
\vspace{2cm}
{\Huge \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Huge ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR\\
Police d'écriture : \textbf{CMU Serif Roman}
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.0pt} % Ligne horizontale en haut

\fancyhead[R]{\underline{\textit{Section \thesubsection}}}
\fancyhead[L]{\underline{\textit{\thepage}}}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{11/10/2024}
\title{Rapport hebdomadaire}
\newcommand{\thesubtitle}{Contrat Été 2024}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Rapport hebdomadaire},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={French}}
\begin{document}

\section{Tâches à accomplir pour la semaine}
\label{sec:org3ede40e}

\begin{itemize}
\item\relax [2/4] \textbf{Terminer la reproduction des résultats de Bismuth avec le set-up de Jeremy et Dany} : J'ai eu quelques problèmes avec Wavewatch à l'installation. Par la suite, les \emph{switches} de \emph{Wavewatch III} que Jérémy m'a fournit ont activé quelques champs dont je ne connaissais pas l'existence.
\begin{itemize}
\item[{$\boxtimes$}] Il faut reproduire le motif de glace d'Éliot Bismuth;
\item[{$\boxtimes$}] S'assurer que le données NetCDF entrent bien dans le modèle de vagues;
\item\relax [0/1] Trouver un moyen de forcer le champ de vagues d'un seul côté seulement;
\begin{itemize}
\item[{$\square$}] Modifier la fonction \emph{ww3 grid} pour changer la \emph{mapsta} et inclure des points frontière;
\item[{$\square$}] Inclusion des points frontière;
\end{itemize}
\item[{$\square$}] Il faut aussi terminer la fonction de distribution de la glace pour lancer plusieurs tâches en même temps en série;
\item[{$\square$}] Conceptualiser un moyen de lire les données sortantes pour le champ de glace. Eliot Bismuth utilisait un rapport du premier moment « \(m_0\) »
\end{itemize}

\item\relax [0/1] \textbf{Retour à Daniella pour la réalisation du «Word Package II»} : Daniella avait pas mal accepté mon aide par courriel. Elle m'a rajouté dans le Teams du \emph{Word Package II}.
\begin{itemize}
\item[{$\square$}] Recontacter l'équipe, dont Jérémy.
\end{itemize}

\item\relax [0/2] \textbf{Lecture du code de Sebastien Dugas pour WAM} :
\begin{itemize}
\item[{$\square$}] Il faut repenser les axes de développement pour s'assurer que le but de ma recherche passe dans les enjeux du milieu.
\item[{$\square$}] Il faut avoir plus d'information de la part de l'ingénieur de Blair. On a très peu d'information sur la manière qu'il fera ses simulation de vagues et de glace.
\end{itemize}
\end{itemize}
\section{Retour sur l'expérience de Bismuth avec Wavewatch III}
\label{sec:org717717b}

\subsection{Ce qu'on doit implémenter en terme de glace dans Wavewatch III}
\label{sec:org6693ef6}

Dans le \href{Fichiers\_pdf/rapport-2024-09-20.pdf}{rapport du 20 septembre}, nous avions un petit tableau qui résumait les expériences de Bismuth.

\begin{table}[!h]
\caption{\label{tab:org2298faf}Tableau tiré de la maîtrise d'Éliot Bimuth.}
\centering
\begin{tabular}{lcrc}
\hline
\hline
Description de la variable & Symbole & Valeur & Unités\\
\hline
Taille de la grille & \(L_x\) & 5 & km\\
Taille des points de grille & \(\Delta x\) & 500 & m\\
Nombre de points de grille & \(n_x\) & 10 & --\\
Épaisseur des floes & \(h\) & 0.5 & m\\
Diamètre moyen des floes & \(\expval{D}\) & 200 & m\\
Période du maximum spectral & \(T_p\) & 6 & s\\
Fréquence du maximum spectral & \(f_p\) & 1/6 & \(\mathrm{s}^{-1}\)\\
Hauteur significative des vagues & \(H_s\) & 1 & m\\
Minimum de fréquence du modèle & \(f_{min}\) & 1/20 & \(\mathrm{s}^{-1}\)\\
Maximum de fréquence du modèle & \(f_{max}\) & 1/2.5 & \(\mathrm{s}^{-1}\)\\
Nombre de fréquences du modèle & \(n_f\) & 61 & --\\
\hline
\end{tabular}
\end{table}


\begin{table}[!h]
\caption{D'autres quantités qui seraient importante lors de la modélisation avec Wavewatch III.}
\centering
\begin{tabular}{lcrcl}
\hline
\hline
Description & Symbole & Valeur & Unités & Note\\
\hline
Champ gravitationnel & \(g\) & 9.81 & \(\mathrm{ms}^{-2}\) & --\\
Vitesse de phase & \(c_p\) & (max) 38.52 & \(\mathrm{ms}^{-1}\) & \(c_p = g/\omega\)\\
Vitesse de groupe & \(c_g\) & (max) 19.26 & \(\mathrm{ms}^{-1}\) & \(c_g = c_p/2\)\\
Pas de temps & \(\Delta t\) & 25.00 & s & \(\Delta t < \Delta x/c^{max}_g\)\\
\hline
Nombre de fréquences & \(nf\) & 40 & -- & \autocite[Voir][switch NL2]{wwiii2016user}\\
\emph{Freq. Increment Factor} & \(IF\) & 1.07 & -- & \autocite[Voir][switch NL2]{wwiii2016user}\\
Fréquence initiale & \(f_{min}\) & 0.05 & \(\mathrm{s}^{-1}\) & Comme suggéré par Eliot Bismuth\\
Fréquences maximale & \(f_{max}\) & -- & \(\mathrm{s}^{-1}\) & \(f_{max} = f_{min}\cdot(IF)^{nf}\)\\
Nombre de directions & \(n_\theta\) & 36 & -- & \autocite[Voir][switch NL2]{wwiii2016user}\\
\hline
\end{tabular}
\end{table}
\subsubsection{Carte de points de Wavewatch III}
\label{sec:org0863776}

Grossièrement, on voudrait que l'entrée et la sortie de notre canal ne soit pas dans le modèle. Concrétement, ça se traduit pas l'abscence de murs sur les côtés ouest et est, mais des murs sur les côtés nord et sud. Ainsi, la \emph{mapsta} devrait ressembler à
\[
\begin{matrix}
 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
 3 & 2 & 1 & 1 & 1 & 1 & 1 & 1 & 1 & 3 \\
 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 & 0 \\
\end{matrix}
\]

Donc visuellement, on voit déjà le canal. Visuellement, on se souvient de ça dans le rapport d'octobre :

\begin{figure}
\begin{center}
\begin{tikzpicture}
   \fill [ForestGreen!10] (0,0) rectangle (10,3);
   \fill [blue!15] (1,1) rectangle (9,2);
   \fill [white] (0,1) rectangle (1,2);
   \fill [white] (9,1) rectangle (10,2);
   \fill [red!15] (1,1) rectangle (2,2);
   \draw[dotted] (0,0) grid (10,3);
   \draw[thick] (0,0) rectangle (10,3);
%%%
   \draw[|{latex}-{latex}|] (10.25,0) -- (10.25,3);
   \draw (10.25,1.5) node [rotate=90,below] {$150$ m};
   \draw[|{latex}-{latex}|] (0,-0.25) -- (10,-0.25);
   \draw (5,-0.5) node [below] {$500$ m};
%%%
   \filldraw [dotted] (-0.25,0.5) -- (0.5,0.5);
   \filldraw [dotted] (-0.25,2.5) -- (0.5,2.5) circle (1pt);
   \draw [decoration={brace}, decorate, thick] (-0.25,0.5) -- (-0.25,2.5);
   \draw (-0.5,1.5) node [rotate=90,above] { 25m à 125m};
%%%
   \filldraw [dotted] (0.5,3.25) -- (0.5,2.5);
   \filldraw [dotted] (9.5,3.25) -- (9.5,2.5) circle (1pt);
   \draw [decoration={brace}, decorate, thick] (0.5,3.25) -- (9.5,3.25);
   \draw (5,3.5) node [above] { 25m à 475m};
 %%%
   \filldraw (0.5,0.5) circle (1pt);
   \draw (0.5,0.5) node [right] {(25m,25m)};
\end{tikzpicture}
\end{center}
\caption{\label{org8d5f46a}Grille initiale fournie à Wavewatch III.}
\end{figure}
\subsubsection{Introduction des conditions frontières dans Wavewatch III}
\label{sec:orgbf8cb5d}

En premier lieu, il faut le mentionner dans la création de notre fichier \emph{mapsta}. Le nombre 2 permet de dire au modèle qu'on veut des points frontière. Ensuite, selon la documentation de Wavewatch : \medskip
\begin{quote}
\emph{If the actual input data is not defined in the actual wave model run, the initial conditions will be applied as constant boundary conditions.}\medskip
\end{quote}
Par conséquent, on peut ne rien définir dans le fichier \emph{ww3 grid}, puis ensuite changer les conditions initiales. L'idée derrière serait donc de laisser le modèle se stabiliser graduellement autour des conditions initiales.\bigskip

Il faut donc créer un spectre Jonswap \autocite{hasselmann1973measurements}. Nous avions pris quelques notes dans notre \href{rapport-2024-08-23.pdf}{rapport du 23 aout 2024} pour synthétiser les données entrantes d'Eliot Bismuth.

\begin{center}
\begin{tabular}{lcccl}
\hline
\hline
Description & Symbole & Valeur & Unités & Notes\\
\hline
Constante pour Goda & -- & 0.205 & ? & \Textcite{goda1988variablity}\\
\emph{Energy level of PM spectrum} & \(\alpha\) & 0.0081 & -- & \Textcite{wwiii2016user} (Constante de Phillips)\\
\emph{Peak frequency} & \(f_m\) & 1/6 & Hz & (Maîtrise d'Eliot Bismuth)\\
\emph{Peak enhancement factor} & \(\gamma\) & 3.3 & -- & \Textcite{hasselmann1973measurements,wwiii2016user}\\
\emph{Spread with GAMMA} & \(\sigma_A\) & 0.07 & -- & \Textcite{hasselmann1973measurements,wwiii2016user}\\
\emph{Spread with GAMMA} & \(\sigma_B\) & 0.09 & -- & \Textcite{hasselmann1973measurements,wwiii2016user}\\
Moyenne directionnelle & \(\overline{\theta}\) & 90 & degrés & \Textcite{wwiii2016user} (Convention océanographique)\\
\hline
\end{tabular}
\end{center}

L'Équation devrait ressembler à (selon la version de \Textcite{goda1988variablity}),
\begin{equation}
   E_{JONSWAP-Goda}(f) = 0.205 H_s^2 \qty(\frac{f_p^4}{f^5}) \exp{-\frac{5}{4}\qty(\frac{f_p}{f})^4} \times 3.3^{\exp{\frac{-(f-f_p)^2}{2\sigma^2 f_p^2}}},
\end{equation}
ou plutôt (selon la version \Textcite{hasselmann1973measurements}), 
\begin{align}
   && E_{JONSWAP}(f) = \alpha g^2 (2\pi)^{-4} f^{-5} \exp[- \frac{5}{4} \qty(\frac{f}{f_m})^{-4}]\times \gamma^{g(f,\sigma)}
   && \text{où}
   && g(f,\sigma) = \exp[ \frac{-(f-f_m)^2}{2\sigma^2f_m^2}]. &&
\end{align}
Selon \Textcite{goda1988variablity} et \Textcite{hasselmann1973measurements}, \(\alpha = 0.205\), mais selon Dugas \(\alpha = 0.2044\). Il a surement une citation que je n'ai pas.

\printbibliography
\end{document}
